{"cik":"0001847416","entityName":"Orion Biotech Opportunities Corp.","facts":{"us-gaap":{"AccountsPayableCurrent":{"label":"Accounts Payable, Current","description":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-03-31","val":22000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"AccruedLiabilitiesCurrent":{"label":"Accrued Liabilities, Current","description":"Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-03-31","val":276265,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"AdditionalPaidInCapital":{"label":"Additional Paid in Capital","description":"Excess of issue price over par or stated value of the entity's capital stock and amounts received from other transactions involving the entity's stock or stockholders. Includes adjustments to additional paid in capital. Some examples of such adjustments include recording the issuance of debt with a beneficial conversion feature and certain tax consequences of equity instruments awarded to employees. Use this element for the aggregate amount of additional paid-in capital associated with common and preferred stock. For additional paid-in capital associated with only common stock, use the element additional paid in capital, common stock. For additional paid-in capital associated with only preferred stock, use the element additional paid in capital, preferred stock.","units":{"USD":[{"end":"2021-03-31","val":24425,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"Assets":{"label":"Assets","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2021-03-31","val":376253,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"DeferredCostsCurrent":{"label":"Deferred Costs, Current","description":"Sum of the carrying amounts as of the balance sheet date of deferred costs capitalized at the end of the reporting period that are expected to be charged against earnings within one year or the normal operating cycle, if longer.","units":{"USD":[{"end":"2021-03-31","val":376253,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"EarningsPerShareBasicAndDiluted":{"label":"Earnings Per Share, Basic and Diluted","description":"The amount of net income or loss for the period per each share in instances when basic and diluted earnings per share are the same amount and reported as a single line item on the face of the financial statements. Basic earnings per share is the amount of net income or loss for the period per each share of common stock or unit outstanding during the reporting period. Diluted earnings per share includes the amount of net income or loss for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.","units":{"USD/shares":[{"start":"2021-02-05","end":"2021-03-31","val":-0.01,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"EquityMethodInvestmentOwnershipPercentage":{"label":"Equity Method Investment, Ownership Percentage","description":"The percentage of ownership of common stock or equity participation in the investee accounted for under the equity method of accounting.","units":{"pure":[{"end":"2021-03-31","val":0.5,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"GeneralAndAdministrativeExpense":{"label":"General and Administrative Expense","description":"The aggregate total of expenses of managing and administering the affairs of an entity, including affiliates of the reporting entity, which are not directly or indirectly associated with the manufacture, sale or creation of a product or product line.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":45085,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"IncreaseDecreaseInAccruedLiabilities":{"label":"Increase (Decrease) in Accrued Liabilities","description":"The increase (decrease) during the reporting period in the aggregate amount of expenses incurred but not yet paid.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":9765,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"LiabilitiesAndStockholdersEquity":{"label":"Liabilities and Equity","description":"Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.","units":{"USD":[{"end":"2021-03-31","val":376253,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"LiabilitiesCurrent":{"label":"Liabilities, Current","description":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer.","units":{"USD":[{"end":"2021-03-31","val":396338,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"NetIncomeLoss":{"label":"Net Income (Loss) Attributable to Parent","description":"The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":-45085,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"NotesPayable":{"label":"Notes Payable","description":"Including the current and noncurrent portions, aggregate carrying amount of all types of notes payable, as of the balance sheet date, with initial maturities beyond one year or beyond the normal operating cycle, if longer.","units":{"USD":[{"end":"2021-03-31","val":98000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"NotesPayableRelatedPartiesClassifiedCurrent":{"label":"Notes Payable, Related Parties, Current","description":"The amount for notes payable (written promise to pay), due to related parties. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-03-31","val":98073,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"PreferredStockParOrStatedValuePerShare":{"label":"Preferred Stock, Par or Stated Value Per Share","description":"Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer.","units":{"USD/shares":[{"end":"2021-03-31","val":0.0001,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"PreferredStockSharesAuthorized":{"label":"Preferred Stock, Shares Authorized","description":"The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.","units":{"shares":[{"end":"2021-03-31","val":5000000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"RelatedPartyTransactionSellingGeneralAndAdministrativeExpensesFromTransactionsWithRelatedParty":{"label":"Related Party Transaction, Selling, General and Administrative Expenses from Transactions with Related Party","description":"Amount of selling, general and administrative expenses resulting from transactions, excluding transactions that are eliminated in consolidated or combined financial statements, with related party.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":25000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"RetainedEarningsAccumulatedDeficit":{"label":"Retained Earnings (Accumulated Deficit)","description":"The cumulative amount of the reporting entity's undistributed earnings or deficit.","units":{"USD":[{"end":"2021-03-31","val":-45085,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"StockholdersEquity":{"label":"Stockholders' Equity Attributable to Parent","description":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.","units":{"USD":[{"end":"2021-03-31","val":-20085,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"StockIssuedDuringPeriodValueOther":{"label":"Stock Issued During Period, Value, Other","description":"Value of shares of stock issued attributable to transactions classified as other.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":25000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"TangibleAssetImpairmentCharges":{"label":"Tangible Asset Impairment Charges","description":"The charge against earnings resulting from the aggregate write down of tangible assets from their carrying value to their fair value.","units":{"USD":[{"start":"2021-02-05","end":"2021-03-31","val":5000001,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}},"TemporaryEquitySharesAuthorized":{"label":"Temporary Equity, Shares Authorized","description":"The maximum number of securities classified as temporary equity that are permitted to be issued by an entity's charter and bylaws. Temporary equity is a security with redemption features that are outside the control of the issuer, is not classified as an asset or liability in conformity with GAAP, and is not mandatorily redeemable. Includes any type of security that is redeemable at a fixed or determinable price or on a fixed or determinable date or dates, is redeemable at the option of the holder, or has conditions for redemption which are not solely within the control of the issuer. If convertible, the issuer does not control the actions or events necessary to issue the maximum number of shares that could be required to be delivered under the conversion option if the holder exercises the option to convert the stock to another class of equity. If the security is a warrant or a rights issue, the warrant or rights issue is considered to be temporary equity if the issuer cannot demonstrate that it would be able to deliver upon the exercise of the option by the holder in all cases. Includes stock with put option held by ESOP and stock redeemable by holder only in the event of a change in control of the issuer.","units":{"shares":[{"end":"2021-03-31","val":1000000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"TemporaryEquitySharesIssued":{"label":"Temporary Equity, Shares Issued","description":"The number of securities classified as temporary equity that have been sold (or granted) to the entity's shareholders. Securities issued include securities outstanding and securities held in treasury. Temporary equity is a security with redemption features that are outside the control of the issuer, is not classified as an asset or liability in conformity with GAAP, and is not mandatorily redeemable. Includes any type of security that is redeemable at a fixed or determinable price or on a fixed or determinable date or dates, is redeemable at the option of the holder, or has conditions for redemption which are not solely within the control of the issuer. If convertible, the issuer does not control the actions or events necessary to issue the maximum number of shares that could be required to be delivered under the conversion option if the holder exercises the option to convert the stock to another class of equity. If the security is a warrant or a rights issue, the warrant or rights issue is considered to be temporary equity if the issuer cannot demonstrate that it would be able to deliver upon the exercise of the option by the holder in all cases. Includes stock with put option held by ESOP and stock redeemable by holder only in the event of a change in control of the issuer.","units":{"shares":[{"end":"2021-03-31","val":0,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"TemporaryEquitySharesOutstanding":{"label":"Temporary Equity, Shares Outstanding","description":"The number of securities classified as temporary equity that have been issued and are held by the entity's shareholders. Securities outstanding equals securities issued minus securities held in treasury. Temporary equity is a security with redemption features that are outside the control of the issuer, is not classified as an asset or liability in conformity with GAAP, and is not mandatorily redeemable. Includes any type of security that is redeemable at a fixed or determinable price or on a fixed or determinable date or dates, is redeemable at the option of the holder, or has conditions for redemption which are not solely within the control of the issuer. If convertible, the issuer does not control the actions or events necessary to issue the maximum number of shares that could be required to be delivered under the conversion option if the holder exercises the option to convert the stock to another class of equity. If the security is a warrant or a rights issue, the warrant or rights issue is considered to be temporary equity if the issuer cannot demonstrate that it would be able to deliver upon the exercise of the option by the holder in all cases. Includes stock with put option held by ESOP and stock redeemable by holder only in the event of a change in control of the issuer.","units":{"shares":[{"end":"2021-03-31","val":0,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1I"}]}},"WeightedAverageNumberOfShareOutstandingBasicAndDiluted":{"label":"Weighted Average Number of Shares Outstanding, Basic and Diluted","description":"Average number of shares or units issued and outstanding that are used in calculating basic and diluted earnings per share (EPS).","units":{"shares":[{"start":"2021-02-05","end":"2021-03-31","val":5000000,"accn":"0001213900-21-034482","fy":2021,"fp":"Q1","form":"10-Q","filed":"2021-06-28","frame":"CY2021Q1"}]}}}}}